content/roam/20210831190212-capstone.org
:PROPERTIES:
:ID:       4b9aa962-6e09-4534-a88e-3b6fc38d4788
:END:
#+title:capstone
application:
ev
methode:
[[./20210830182842-deep_reinforcement_learning.org][deep-reinforcement-learning]]
platform:
[[./20210831172004-simulation.org][simulation]]
[[./20210831172038-carla.org][carla]]


* DONE start new org file for capstone
* TODO create outline of the org file for capstone
SCHEDULED: <2021-09-03 五>
* [[./20210901102331-cooperative_reinforcement_learning.org][cooperative reinforcement learning]]
** for veos


* Longicontrol
** transfer learning: from Gym to the real world
** from planning to model-based reinforcement learning [[./20210830182842-deep_reinforcement_learning.org][deep-reinforcement-learning]]
** github repo is in [[https://github.com/dynamik1703/gym_longicontrol.git][LongiControl]]
** safety / conflicting goals / explainable
** [[./20210901135410-system_identification.org][system identification]]
*** road load coefficient A, B, C

* [[./20210831172004-simulation.org][simulation]]
** construct typical highway, urban scenarios
** pgdrive
** Assessment of veos strategy in open-ended simulation and its improvement: regarding overfitting, safety performance, traffic rule respectation and generalization, multi-agent behavior

* [[./20210930153026-um_sjtu_t5.org][UM-SJTU-T5]]
** Gitlab, ScrUM & Jira
*** 电脑,服务器
*** 公司账号,vpn
*** 分工?故事点分解?
** Seminar?
*** RL
*** PCG
*** 路阻系数
** 按开发内容的开发状态
*** 环境安装
*** 仿真接口:
**** 运动状态,安全状态,记录,
**** 孵化接口
**** traffic manager
**** 训练?
*** 能量接口(PGDrive) paper 调研;
*** 理论:路阻系数 (查找) --> 能量, 比较


** design review
*** customer requirements
