20210831190212-capstone.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>capstone</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">capstone</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga92bdad"><span class="done DONE">DONE</span> start new org file for capstone</a></li>
<li><a href="#org39a0c88"><span class="todo TODO">TODO</span> create outline of the org file for capstone</a></li>
<li><a href="#orgd479397">cooperative reinforcement learning</a>
<ul>
<li><a href="#orga04c151">for veos</a></li>
</ul>
</li>
<li><a href="#org6db9b72">Longicontrol</a>
<ul>
<li><a href="#org6f3358d">transfer learning: from Gym to the real world</a></li>
<li><a href="#org06e7e56">from planning to model-based reinforcement learning deep-reinforcement-learning</a></li>
<li><a href="#orgbb08e9a">github repo is in LongiControl</a></li>
<li><a href="#orgda5b246">safety / conflicting goals / explainable</a></li>
<li><a href="#org18a25a1">system identification</a>
<ul>
<li><a href="#orgcba1eaf">road load coefficient A, B, C</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org17255b4">simulation</a>
<ul>
<li><a href="#org0c1d149">construct typical highway, urban scenarios</a></li>
<li><a href="#org589e7ba">pgdrive</a></li>
<li><a href="#orgac7f153">Assessment of veos strategy in open-ended simulation and its improvement: regarding overfitting, safety performance, traffic rule respectation and generalization, multi-agent behavior</a></li>
</ul>
</li>
<li><a href="#org704b9bd">UM-SJTU-T5</a>
<ul>
<li><a href="#org47eb151">Gitlab, ScrUM &amp; Jira</a>
<ul>
<li><a href="#org3db2344">电脑,服务器</a></li>
<li><a href="#org6bce04e">公司账号,vpn</a></li>
<li><a href="#orgf2cc9c7">分工?故事点分解?</a></li>
</ul>
</li>
<li><a href="#orga59b7ec">Seminar?</a>
<ul>
<li><a href="#org4d5329f">RL</a></li>
<li><a href="#org392e2f8">PCG</a></li>
<li><a href="#orga40092f">路阻系数</a></li>
</ul>
</li>
<li><a href="#org7984680">按开发内容的开发状态</a>
<ul>
<li><a href="#org97dae6f">环境安装</a></li>
<li><a href="#orgfb5a11e">仿真接口:</a></li>
<li><a href="#orgc894a17">能量接口(PGDrive) paper 调研;</a></li>
<li><a href="#org4ed9645">理论:路阻系数 (查找) &#x2013;&gt; 能量, 比较</a></li>
</ul>
</li>
<li><a href="#org2110e6a">design review</a>
<ul>
<li><a href="#org28d840f">customer requirements</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       4b9aa962-6e09-4534-a88e-3b6fc38d4788
</p>
<p>
application:
ev
methode:
<a href="./20210830182842-deep_reinforcement_learning.html">deep-reinforcement-learning</a>
platform:
<a href="./20210831172004-simulation.html">simulation</a>
<a href="./20210831172038-carla.html">carla</a>
</p>


<div id="outline-container-orga92bdad" class="outline-2">
<h2 id="orga92bdad"><span class="done DONE">DONE</span> start new org file for capstone</h2>
</div>
<div id="outline-container-org39a0c88" class="outline-2">
<h2 id="org39a0c88"><span class="todo TODO">TODO</span> create outline of the org file for capstone</h2>
<div class="outline-text-2" id="text-org39a0c88">
</div>
</div>
<div id="outline-container-orgd479397" class="outline-2">
<h2 id="orgd479397"><a href="./20210901102331-cooperative_reinforcement_learning.html">cooperative reinforcement learning</a></h2>
<div class="outline-text-2" id="text-orgd479397">
</div>
<div id="outline-container-orga04c151" class="outline-3">
<h3 id="orga04c151">for veos</h3>
</div>
</div>


<div id="outline-container-org6db9b72" class="outline-2">
<h2 id="org6db9b72">Longicontrol</h2>
<div class="outline-text-2" id="text-org6db9b72">
</div>
<div id="outline-container-org6f3358d" class="outline-3">
<h3 id="org6f3358d">transfer learning: from Gym to the real world</h3>
</div>
<div id="outline-container-org06e7e56" class="outline-3">
<h3 id="org06e7e56">from planning to model-based reinforcement learning <a href="./20210830182842-deep_reinforcement_learning.html">deep-reinforcement-learning</a></h3>
</div>
<div id="outline-container-orgbb08e9a" class="outline-3">
<h3 id="orgbb08e9a">github repo is in <a href="https://github.com/dynamik1703/gym_longicontrol.git">LongiControl</a></h3>
</div>
<div id="outline-container-orgda5b246" class="outline-3">
<h3 id="orgda5b246">safety / conflicting goals / explainable</h3>
</div>
<div id="outline-container-org18a25a1" class="outline-3">
<h3 id="org18a25a1"><a href="./20210901135410-system_identification.html">system identification</a></h3>
<div class="outline-text-3" id="text-org18a25a1">
</div>
<div id="outline-container-orgcba1eaf" class="outline-4">
<h4 id="orgcba1eaf">road load coefficient A, B, C</h4>
</div>
</div>
</div>

<div id="outline-container-org17255b4" class="outline-2">
<h2 id="org17255b4"><a href="./20210831172004-simulation.html">simulation</a></h2>
<div class="outline-text-2" id="text-org17255b4">
</div>
<div id="outline-container-org0c1d149" class="outline-3">
<h3 id="org0c1d149">construct typical highway, urban scenarios</h3>
</div>
<div id="outline-container-org589e7ba" class="outline-3">
<h3 id="org589e7ba">pgdrive</h3>
</div>
<div id="outline-container-orgac7f153" class="outline-3">
<h3 id="orgac7f153">Assessment of veos strategy in open-ended simulation and its improvement: regarding overfitting, safety performance, traffic rule respectation and generalization, multi-agent behavior</h3>
</div>
</div>

<div id="outline-container-org704b9bd" class="outline-2">
<h2 id="org704b9bd"><a href="./20210930153026-um_sjtu_t5.html">UM-SJTU-T5</a></h2>
<div class="outline-text-2" id="text-org704b9bd">
</div>
<div id="outline-container-org47eb151" class="outline-3">
<h3 id="org47eb151">Gitlab, ScrUM &amp; Jira</h3>
<div class="outline-text-3" id="text-org47eb151">
</div>
<div id="outline-container-org3db2344" class="outline-4">
<h4 id="org3db2344">电脑,服务器</h4>
</div>
<div id="outline-container-org6bce04e" class="outline-4">
<h4 id="org6bce04e">公司账号,vpn</h4>
</div>
<div id="outline-container-orgf2cc9c7" class="outline-4">
<h4 id="orgf2cc9c7">分工?故事点分解?</h4>
</div>
</div>
<div id="outline-container-orga59b7ec" class="outline-3">
<h3 id="orga59b7ec">Seminar?</h3>
<div class="outline-text-3" id="text-orga59b7ec">
</div>
<div id="outline-container-org4d5329f" class="outline-4">
<h4 id="org4d5329f">RL</h4>
</div>
<div id="outline-container-org392e2f8" class="outline-4">
<h4 id="org392e2f8">PCG</h4>
</div>
<div id="outline-container-orga40092f" class="outline-4">
<h4 id="orga40092f">路阻系数</h4>
</div>
</div>
<div id="outline-container-org7984680" class="outline-3">
<h3 id="org7984680">按开发内容的开发状态</h3>
<div class="outline-text-3" id="text-org7984680">
</div>
<div id="outline-container-org97dae6f" class="outline-4">
<h4 id="org97dae6f">环境安装</h4>
</div>
<div id="outline-container-orgfb5a11e" class="outline-4">
<h4 id="orgfb5a11e">仿真接口:</h4>
<div class="outline-text-4" id="text-orgfb5a11e">
</div>
<ul class="org-ul">
<li><a id="org9207012"></a>运动状态,安全状态,记录,<br /></li>
<li><a id="org0925db8"></a>孵化接口<br /></li>
<li><a id="org45db2ca"></a>traffic manager<br /></li>
<li><a id="org8456a3f"></a>训练?<br /></li>
</ul>
</div>
<div id="outline-container-orgc894a17" class="outline-4">
<h4 id="orgc894a17">能量接口(PGDrive) paper 调研;</h4>
</div>
<div id="outline-container-org4ed9645" class="outline-4">
<h4 id="org4ed9645">理论:路阻系数 (查找) &#x2013;&gt; 能量, 比较</h4>
</div>
</div>


<div id="outline-container-org2110e6a" class="outline-3">
<h3 id="org2110e6a">design review</h3>
<div class="outline-text-3" id="text-org2110e6a">
</div>
<div id="outline-container-org28d840f" class="outline-4">
<h4 id="org28d840f">customer requirements</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
